[
    {
        "name": "folio",
        "description": "Folio is a minimalist digital whiteboard that can be used for sketching and prototyping, or just as a infinite canvas to take notes. It can be used via the web application or as Docker image to run it locally.",
        "date": "Jan 01, 2020 - Present",
        "links": [
            {"text": "Visit website", "url": "https://folio.josemi.xyz"},
            {"text": "GitHub Repository", "url": "https://github.com/jmjuanes/folio"}
        ]
    },
    {
        "name": "mikel",
        "description": "A lightweight and extremely fast template engine inspired by mustache. It provides a simple way to render templates using data objects, supporting features such as variables, partials, conditional sections, and looping.",
        "date": "Mar 23, 2023 - Present",
        "links": [
            {"text": "View on GitHub", "url": "https://github.com/jmjuanes/mikel"}
        ]
    },
    {
        "name": "josemi/icons",
        "description": "A collection of handcrafted and open source line icons designed for use in web applications, with a focus on minimalism and clarity. It supports both SVG and React components, making it easy to integrate into your projects.",
        "date": "Jan 17, 2023 - Present",
        "links": [
            {"text": "Explore Icons", "url": "https://icons.josemi.xyz"},
            {"text": "View on GitHub", "url": "https://github.com/jmjuanes/icons"}
        ]
    },
    {
        "name": "lowcss",
        "description": "LowCSS is a minimal CSS Utility library designed to build fast and lightweight web applications. It provides a set of utility classes that can be used to style HTML elements without the need for a full CSS framework.",
        "date": "Oct 16, 2022 - Present",
        "links": [
            {"text": "Documentation", "url": "https://low.josemi.xyz"},
            {"text": "View on GitHub", "url": "https://github.com/jmjuanes/lowcss"}
        ]
    },
    {
        "name": "mokai",
        "description": "An extremely small and predictable for editing short snippets of HTML / JS / CSS / Markdown without shipping a full IDE. Mokai focuses on: tiny surface area, no virtual DOM, no workers by default, and opt-in syntax highlighting.",
        "date": "Dec 27, 2021 - Present",
        "links": [
            {"text": "View on GitHub", "url": "https://github.com/jmjuanes/mokai"}
        ]
    }
]